Documents/ЗаменаПриборовУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>ЗаменаПриборовУчета</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ПломбыПриборовУчета</xr:Item>
				<xr:Item>InformationRegister.УстановленныеПриборыУчета</xr:Item>
				<xr:Item>InformationRegister.ПоказанияПриборовУчета</xr:Item>
				<xr:Item>AccumulationRegister.ЗаменыПриборовУчета</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗданияИСооружения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УказатьПломбыПриборовУчета</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Основная</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОбъектУстановки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПриборУчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПриборыУчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоказаниеПредыдущее</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Показание</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтветственныйВладелец</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПотребителиУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъектЛицевогоСчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОбъектыЛицевыхСчетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПриборУчетаНовый</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПриборыУчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоказаниеНовое</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидТарифаПредыдущий</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыТарифов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидТарифаНовый</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыТарифов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерийныйНомер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерийныйНомерНовый</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидПломбы</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыПломбПриборовУчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидПломбыНовый</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыПломбПриборовУчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/УстановленныеПриборыУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>УстановленныеПриборыУчета</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Действует</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СреднемесячноеПоказание</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>МестоРазмещения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПрибора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСледующейПоверки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоследнейПоверки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ОбъектУстановки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗданияИСооружения</v8:Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПриборУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПриборыУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПоказанияПриборовУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ПоказанияПриборовУчета</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отключен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИсточникиПоказаний</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ПриборУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПриборыУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидТарифа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыТарифов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ОтветственныйВладелецЛицевогоСчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ОтветственныйВладелецЛицевогоСчета</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОтветственныйВладелец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПотребителиУслуг</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПломбыПриборовУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ПломбыПриборовУчета</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Действует</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗданияИСооружения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПриборУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПриборыУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПломбы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПломбПриборовУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерийныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ТарифностьСчетчиков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ТарифностьСчетчиков</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Однотарифный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Двухтарифный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Трехтарифный</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыОперацийУправленияПриборамиУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ВидыОперацийУправленияПриборамиУчета</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>УстановкаПрибораУчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтключениеПрибораУчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтключениеНаПоверку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВключениеПослеПоверки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаменаПломбы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ПриборыУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Catalog>
		<Properties>
			<Name>ПриборыУчета</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаводскойНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тарифность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТарифностьСчетчиков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособРегистрацииПоказаний</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыРегистрацииПоказанийСчетчиков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Коэффициент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Разрядность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбщедомовойСчетчик</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗданияИСооружения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВРО</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВКО</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/ЗаменаПриборовУчета/Forms/ФормаДокумента/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Функция получает список лицевых счетов из временного хранилища
//
&НаСервере
Процедура ПолучитьЛицевыеСчетаИзХранилища(АдресЛицевыхСчетовВХранилище)
	
	ТаблицаДляЗагрузки	= ПолучитьИзВременногоХранилища(АдресЛицевыхСчетовВХранилище);
	
	МассивОбъектовУстановки = ТаблицаДляЗагрузки.ВыгрузитьКолонку("ЛицевойСчет");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УстановленныеПриборыУчетаСрезПоследних.ОбъектУстановки,
		|	УстановленныеПриборыУчетаСрезПоследних.ПриборУчета,
		|	ЕСТЬNULL(ПоказанияПриборовУчетаСрезПоследних.Значение, 0) КАК ПоказаниеПредыдущее,
		|	УстановленныеПриборыУчетаСрезПоследних.ОбъектУстановки.ОбъектЛицевогоСчета.Наименование КАК НаименованиеОбъектЛицевогоСчета,
		|	УстановленныеПриборыУчетаСрезПоследних.ОбъектУстановки.ОбъектЛицевогоСчета КАК ОбъектЛицевогоСчета,
		|	УстановленныеПриборыУчетаСрезПоследних.ПриборУчета.Услуга КАК Услуга,
		|	ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ОтветственныйВладелец,
		|	ПоказанияПриборовУчетаСрезПоследних.ВидТарифа КАК ВидТарифаПредыдущий,
		|	УстановленныеПриборыУчетаСрезПоследних.ПриборУчета.Тарифность,
		|	ВЫБОР
		|		КОГДА УстановленныеПриборыУчетаСрезПоследних.ПриборУчета.Тарифность = ЗНАЧЕНИЕ(Перечисление.ТарифностьСчетчиков.Однотарифный)
		|			ТОГДА 1
		|		КОГДА УстановленныеПриборыУчетаСрезПоследних.ПриборУчета.Тарифность = ЗНАЧЕНИЕ(Перечисление.ТарифностьСчетчиков.Двухтарифный)
		|			ТОГДА 2
		|		КОГДА УстановленныеПриборыУчетаСрезПоследних.ПриборУчета.Тарифность = ЗНАЧЕНИЕ(Перечисление.ТарифностьСчетчиков.Трехтарифный)
		|			ТОГДА 3
		|	КОНЕЦ КАК Тарифность,
		|	ПломбыПриборовУчетаСрезПоследних.ВидПломбы,
		|	ПломбыПриборовУчетаСрезПоследних.СерийныйНомер,
		|	ПломбыПриборовУчетаСрезПоследних.Действует
		|ИЗ
		|	РегистрСведений.УстановленныеПриборыУчета.СрезПоследних(
		|			&ПериодПоказаний,
		|			ОбъектУстановки В (&ОбъектыУстановки)
		|				И ПриборУчета.Услуга = &Услуга) КАК УстановленныеПриборыУчетаСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПоказанияПриборовУчета.СрезПоследних(&ПериодПоказаний, ) КАК ПоказанияПриборовУчетаСрезПоследних
		|		ПО УстановленныеПриборыУчетаСрезПоследних.ПриборУчета = ПоказанияПриборовУчетаСрезПоследних.ПриборУчета
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныйВладелецЛицевогоСчета.СрезПоследних(&ПериодПоказаний, ) КАК ОтветственныйВладелецЛицевогоСчетаСрезПоследних
		|		ПО УстановленныеПриборыУчетаСрезПоследних.ОбъектУстановки = ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ЛицевойСчет
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПломбыПриборовУчета.СрезПоследних КАК ПломбыПриборовУчетаСрезПоследних
		|		ПО УстановленныеПриборыУчетаСрезПоследних.ПриборУчета = ПломбыПриборовУчетаСрезПоследних.ПриборУчета
		|ГДЕ
		|	УстановленныеПриборыУчетаСрезПоследних.Действует = ИСТИНА
		|
		|УПОРЯДОЧИТЬ ПО
		|	НаименованиеОбъектЛицевогоСчета";
		
	Запрос.Параметры.Вставить("ПериодПоказаний", КонецДня(Объект.Дата - 24*60*60));
	Запрос.Параметры.Вставить("ОбъектыУстановки", МассивОбъектовУстановки);
	Запрос.Параметры.Вставить("Услуга", Объект.Услуга);
	
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
		
	Для каждого СтрокаТаблицаЗапроса Из ТаблицаЗапроса Цикл
		
		СтруктураПоиска = Новый Структура;
		СтруктураПоиска.Вставить("ПриборУчета", СтрокаТаблицаЗапроса.ПриборУчета);
		СтруктураПоиска.Вставить("ВидТарифаПредыдущий", СтрокаТаблицаЗапроса.ВидТарифаПредыдущий);
		МассивСтрок = Объект.Основная.НайтиСтроки(СтруктураПоиска); //Вид тарифа
		
		Если МассивСтрок.Количество() > 0 Тогда         
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = Объект.Основная.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицаЗапроса);
	
	КонецЦикла;  
	
	Объект.Основная.Сортировать("ОбъектЛицевогоСчета");
	
КонецПроцедуры // ПолучитьЛицевыеСчетаИзХранилища()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

// Процедура - Установка видимости элементов формы
//
// Параметры
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
&НаКлиенте
Процедура УстановитьВидимостьДоступность()

	Если Объект.УказатьПломбыПриборовУчета Тогда
		Элементы.ОсновнаяВидПломбы.Видимость 			= Истина;
		Элементы.ОсновнаяВидПломбыНовый.Видимость 		= Истина;
		Элементы.ОсновнаяСерийныйНомер.Видимость 		= Истина;
		Элементы.ОсновнаяСерийныйНомерНовый.Видимость	= Истина;
	Иначе
		Элементы.ОсновнаяВидПломбы.Видимость 			= Ложь;
		Элементы.ОсновнаяВидПломбыНовый.Видимость 		= Ложь;
		Элементы.ОсновнаяСерийныйНомер.Видимость 		= Ложь;
		Элементы.ОсновнаяСерийныйНомерНовый.Видимость	= Ложь;
	КонецЕсли;
	

КонецПроцедуры // УстановитьВидимостьДоступность()


// Процедура - обработчик события ПриСозданииНаСервере.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОСМДСервер.ЗаполнитьШапкуДокумента(
		Объект,
		,
		Параметры.ЗначениеКопирования,
		Параметры.Основание,
		СостояниеДокумента,
		КартинкаСостоянияДокумента,
		РазрешеноПроведение,
		ПоследнееИзменение,
		Параметры.ЗначенияЗаполнения);
	
	Если ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
		Объект.Основная.Очистить();
	КонецЕсли;
	
	// ДополнительныеОтчетыИОбработки
	ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтаФорма);
	// Конец ДополнительныеОтчетыИОбработки
	
	Локализация.ПриСозданииНаСервере(ЭтаФорма, Объект.Ссылка);
	
КонецПроцедуры

// Процедура - обработчик события ПослеЗаписи.
//
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ОСМДКлиент.ОбновитьСостояниеДокумента(Объект, СостояниеДокумента, КартинкаСостоянияДокумента, РазрешеноПроведение, ПоследнееИзменение);
	
КонецПроцедуры

// Процедура - обработчик события ПриЧтенииНаСервере.
//
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Процедура - обработчик команды Заполнить.
//
&НаКлиенте
Процедура Заполнить(Команда)
	
	Если Объект.Основная.Количество() > 0 Тогда
		Ответ = Вопрос(НСтр("ru='Для полной очистки табличной части нажмите ""Да"", 
						|Для добавления строк в табличной части нажмите ""Нет"",
						|иначе ""Отмена""';uk='Для полной очистки табличной части нажмите ""Да"",
						|Для добавления строк в табличной части нажмите ""Нет"",						
						|иначе ""Отмена""'"),
		                      РежимДиалогаВопрос.ДаНетОтмена, , КодВозвратаДиалога.Да);
		Если Ответ = КодВозвратаДиалога.Отмена Тогда
			Возврат;
		ИначеЕсли Ответ = КодВозвратаДиалога.Да Тогда
			Объект.Основная.Очистить();
		КонецЕсли;
	КонецЕсли;
	
	
	ПараметрыЗаполнения = Новый Структура;
	
	ПараметрыЗаполнения.Вставить("ДатаНачала",		НачалоМесяца(Объект.Дата));
	ПараметрыЗаполнения.Вставить("ДатаОкончания",	Объект.Дата);
	ПараметрыЗаполнения.Вставить("ОтборОрганизация",	Объект.Организация);
	ПараметрыЗаполнения.Вставить("ОтборЗдание",			Объект.Здание);
	
	АдресЛицевыхСчетовВХранилище = ОткрытьФормуМодально("ОбщаяФорма.ФормаПодбораЛицевыхСчетов", ПараметрыЗаполнения);
	
	Если ЗначениеЗаполнено(АдресЛицевыхСчетовВХранилище) Тогда
		
		ПолучитьЛицевыеСчетаИзХранилища(АдресЛицевыхСчетовВХранилище);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеОсновнаяПоказаниеПриИзменении(СтруктураДанные)
	
	СтруктураДанные = Справочники.ПриборыУчета.ПолучитьРасход(СтруктураДанные);
	
	Возврат СтруктураДанные;
	
КонецФункции

&НаКлиенте
Процедура ОсновнаяПоказаниеПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Основная.ТекущиеДанные;
	Если Не ТекущиеДанные = Неопределено Тогда
		
		СтруктураДанные = Новый Структура();
		СтруктураДанные.Вставить("ПриборУчета", ТекущиеДанные.ПриборУчета);
		СтруктураДанные.Вставить("ПредыдущееПоказание", ТекущиеДанные.ПоказаниеПредыдущее);
		СтруктураДанные.Вставить("ТекущееПоказание", ТекущиеДанные.Показание);
		
		СтруктураДанные = ПолучитьДанныеОсновнаяПоказаниеПриИзменении(СтруктураДанные);
		
		Если ЗначениеЗаполнено(СтруктураДанные.ТекстОшибки) Тогда
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтруктураДанные.ТекстОшибки);

			ТекущиеДанные.Показание = ПоказаниеПередРедактированием;
			
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОсновнаяПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
   	Если Не ТекущиеДанные = Неопределено Тогда
    	ПоказаниеПередРедактированием = ТекущиеДанные.Показание;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОсновнаяПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	Отказ = Истина;
КонецПроцедуры


&НаКлиенте
Процедура ОсновнаяПриборУчетаНовыйНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.Основная.ТекущиеДанные;
	Если НЕ ТекущиеДанные = Неопределено Тогда
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("ОбъектУстановки",		ТекущиеДанные.ОбъектУстановки);
		СтруктураПараметров.Вставить("ВидОперации",			ПредопределенноеЗначение("Перечисление.ВидыОперацийУправленияПриборамиУчета.УстановкаПрибораУчета"));
		СтруктураПараметров.Вставить("ДатаУстановки",		Объект.Дата);
		СтруктураПараметров.Вставить("Услуга",				Объект.Услуга);
														
		ОткрытьФорму("Справочник.ПриборыУчета.Форма.ФормаВыбораНеустановленных", СтруктураПараметров, Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПриборУчетаУстановлен(ПриборУчета)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УстановленныеПриборыУчетаСрезПоследних.ПриборУчета
		|ИЗ
		|	РегистрСведений.УстановленныеПриборыУчета.СрезПоследних КАК УстановленныеПриборыУчетаСрезПоследних
		|ГДЕ
		|	УстановленныеПриборыУчетаСрезПоследних.Действует = ИСТИНА
		|	И УстановленныеПриборыУчетаСрезПоследних.ПриборУчета = &ПриборУчета";
		
		
	Запрос.УстановитьПараметр("ПриборУчета", ПриборУчета);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;

КонецФункции

&НаКлиенте
Процедура ОсновнаяПриборУчетаНовыйОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ПриборУчетаУстановлен(ВыбранноеЗначение) Тогда
			
		НСтрока = НСтр("ru='Прибор учета уже установлен';uk='Прилад обліку вже встановлений'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтрока,, "Объект.ПриборыУчета.ПриборУчета");
		
		СтандартнаяОбработка = Ложь;
	Иначе
		ТекущиеДанные = Элементы.Основная.ТекущиеДанные;
		ДобавитьстрокиПоНадобности(ТекущиеДанные.ПриборУчета,ВыбранноеЗначение,ТекущиеДанные.ИсходныйНомерСтроки,ТекущиеДанные.ОбъектУстановки);
		
	КонецЕсли;
	
	
	
КонецПроцедуры


&НаСервере
Процедура ДобавитьстрокиПоНадобности(ПриборУчета,ПриборУчетаНовый,Индекс,ЛС)

	ТарифностьСтарыйЧисло = ПолучитьЧислоТарифов(ПриборУчета.Тарифность);
	ТарифностьНовыйЧисло = ПолучитьЧислоТарифов(ПриборУчетаНовый.Тарифность);
	
	Если ТарифностьСтарыйЧисло < ТарифностьНовыйЧисло Тогда
		
		КолВоСтрок =  ТарифностьНовыйЧисло - ТарифностьСтарыйЧисло;
		
		Пока КолВоСтрок > 0 Цикл
			НоваяСтрока = Объект.Основная.Вставить(Индекс+1);
			НоваяСтрока.ОбъектУстановки = ЛС;
			НоваяСтрока.ПриборУчетаНовый = ПриборУчетаНовый;
			КолВоСтрок = КолВоСтрок - 1;
		КонецЦикла;
	КонецЕсли;
	
	

КонецПроцедуры // ДобавитьстрокиПоНадобности()

Функция ПолучитьЧислоТарифов(Тарифность)
	
	Если Тарифность = Перечисления.ТарифностьСчетчиков.Однотарифный Тогда
		возврат 1;
	ИначеЕсли Тарифность = Перечисления.ТарифностьСчетчиков.Двухтарифный Тогда
		Возврат 2;
	Иначе
		Возврат 3;
	КонецЕсли;	
	
КонецФункции

&НаКлиенте
Процедура УказатьПломбыПриборовУчетаПриИзменении(Элемент)
	УстановитьВидимостьДоступность()
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимостьДоступность();
КонецПроцедуры
